results/html/statistics.json
{
  "CategoriesPage" : {
    "transaction" : "CategoriesPage",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 21.8,
    "medianResTime" : 18.0,
    "minResTime" : 18.0,
    "maxResTime" : 34.0,
    "pct1ResTime" : 34.0,
    "pct2ResTime" : 34.0,
    "pct3ResTime" : 34.0,
    "throughput" : 0.6561679790026247,
    "receivedKBytesPerSec" : 10.08179031332021,
    "sentKBytesPerSec" : 0.09035125492125984
  },
  "TopPage" : {
    "transaction" : "TopPage",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.0,
    "medianResTime" : 17.0,
    "minResTime" : 15.0,
    "maxResTime" : 19.0,
    "pct1ResTime" : 19.0,
    "pct2ResTime" : 19.0,
    "pct3ResTime" : 19.0,
    "throughput" : 0.6558237145855194,
    "receivedKBytesPerSec" : 3.3722404167759708,
    "sentKBytesPerSec" : 0.08582068140083945
  },
  "GadgetsPage" : {
    "transaction" : "GadgetsPage",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18.0,
    "medianResTime" : 18.0,
    "minResTime" : 16.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 20.0,
    "pct2ResTime" : 20.0,
    "pct3ResTime" : 20.0,
    "throughput" : 0.6560818790185016,
    "receivedKBytesPerSec" : 6.074139302584962,
    "sentKBytesPerSec" : 0.0954650390368718
  },
  "SpeakersPage" : {
    "transaction" : "SpeakersPage",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.4,
    "medianResTime" : 18.0,
    "minResTime" : 15.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 20.0,
    "pct2ResTime" : 20.0,
    "pct3ResTime" : 20.0,
    "throughput" : 0.6554798112218144,
    "receivedKBytesPerSec" : 4.752484678159413,
    "sentKBytesPerSec" : 0.09601755047194546
  },
  "NoticesPage" : {
    "transaction" : "NoticesPage",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.4,
    "medianResTime" : 15.0,
    "minResTime" : 12.0,
    "maxResTime" : 18.0,
    "pct1ResTime" : 18.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 18.0,
    "throughput" : 0.6554798112218144,
    "receivedKBytesPerSec" : 3.2277259766649187,
    "sentKBytesPerSec" : 0.08833614643418983
  },
  "TabletsPage" : {
    "transaction" : "TabletsPage",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.0,
    "medianResTime" : 17.0,
    "minResTime" : 16.0,
    "maxResTime" : 18.0,
    "pct1ResTime" : 18.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 18.0,
    "throughput" : 0.6554798112218144,
    "receivedKBytesPerSec" : 4.657107244690613,
    "sentKBytesPerSec" : 0.09537743346879916
  },
  "HomePage" : {
    "transaction" : "HomePage",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 107.2,
    "medianResTime" : 59.0,
    "minResTime" : 55.0,
    "maxResTime" : 292.0,
    "pct1ResTime" : 292.0,
    "pct2ResTime" : 292.0,
    "pct3ResTime" : 292.0,
    "throughput" : 0.6251562890722681,
    "receivedKBytesPerSec" : 8.213967554388597,
    "sentKBytesPerSec" : 0.07936554451112778
  },
  "WatchesPage" : {
    "transaction" : "WatchesPage",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18.2,
    "medianResTime" : 18.0,
    "minResTime" : 17.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 20.0,
    "pct2ResTime" : 20.0,
    "pct3ResTime" : 20.0,
    "throughput" : 0.6556517178075006,
    "receivedKBytesPerSec" : 5.1500674091922365,
    "sentKBytesPerSec" : 0.09540244722003671
  },
  "AccountPage" : {
    "transaction" : "AccountPage",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.4,
    "medianResTime" : 15.0,
    "minResTime" : 14.0,
    "maxResTime" : 26.0,
    "pct1ResTime" : 26.0,
    "pct2ResTime" : 26.0,
    "pct3ResTime" : 26.0,
    "throughput" : 0.6558237145855194,
    "receivedKBytesPerSec" : 6.0025802564270725,
    "sentKBytesPerSec" : 0.08838249278593914
  },
  "PopularPage" : {
    "transaction" : "PopularPage",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16.2,
    "medianResTime" : 16.0,
    "minResTime" : 15.0,
    "maxResTime" : 18.0,
    "pct1ResTime" : 18.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 18.0,
    "throughput" : 0.6560818790185016,
    "receivedKBytesPerSec" : 2.8840693068494945,
    "sentKBytesPerSec" : 0.08841728447710273
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 80,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 23.924999999999994,
    "medianResTime" : 17.0,
    "minResTime" : 12.0,
    "maxResTime" : 292.0,
    "pct1ResTime" : 28.700000000000017,
    "pct2ResTime" : 58.85000000000001,
    "pct3ResTime" : 292.0,
    "throughput" : 9.699321047526674,
    "receivedKBytesPerSec" : 75.95970235208536,
    "sentKBytesPerSec" : 1.3396950397065956
  },
  "ContactPage" : {
    "transaction" : "ContactPage",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.0,
    "medianResTime" : 15.0,
    "minResTime" : 12.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 17.0,
    "pct2ResTime" : 17.0,
    "pct3ResTime" : 17.0,
    "throughput" : 0.6480881399870383,
    "receivedKBytesPerSec" : 3.581193292287751,
    "sentKBytesPerSec" : 0.08734000324044071
  },
  "BlogPage" : {
    "transaction" : "BlogPage",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.2,
    "medianResTime" : 15.0,
    "minResTime" : 13.0,
    "maxResTime" : 19.0,
    "pct1ResTime" : 19.0,
    "pct2ResTime" : 19.0,
    "pct3ResTime" : 19.0,
    "throughput" : 0.6556517178075006,
    "receivedKBytesPerSec" : 3.264428435615001,
    "sentKBytesPerSec" : 0.0864384588906373
  },
  "TermsPage" : {
    "transaction" : "TermsPage",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 33.0,
    "medianResTime" : 16.0,
    "minResTime" : 13.0,
    "maxResTime" : 100.0,
    "pct1ResTime" : 100.0,
    "pct2ResTime" : 100.0,
    "pct3ResTime" : 100.0,
    "throughput" : 0.6480041472265422,
    "receivedKBytesPerSec" : 4.232530213193364,
    "sentKBytesPerSec" : 0.08606305080352514
  },
  "SmartphonesPage" : {
    "transaction" : "SmartphonesPage",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.4,
    "medianResTime" : 18.0,
    "minResTime" : 15.0,
    "maxResTime" : 19.0,
    "pct1ResTime" : 19.0,
    "pct2ResTime" : 19.0,
    "pct3ResTime" : 19.0,
    "throughput" : 0.6558237145855194,
    "receivedKBytesPerSec" : 4.731281356571354,
    "sentKBytesPerSec" : 0.09798928548006296
  },
  "NewPage" : {
    "transaction" : "NewPage",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.2,
    "medianResTime" : 17.0,
    "minResTime" : 15.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 20.0,
    "pct2ResTime" : 20.0,
    "pct3ResTime" : 20.0,
    "throughput" : 0.6558237145855194,
    "receivedKBytesPerSec" : 6.402863285348898,
    "sentKBytesPerSec" : 0.08582068140083945
  },
  "ComputersPage" : {
    "transaction" : "ComputersPage",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 19.4,
    "medianResTime" : 18.0,
    "minResTime" : 15.0,
    "maxResTime" : 29.0,
    "pct1ResTime" : 29.0,
    "pct2ResTime" : 29.0,
    "pct3ResTime" : 29.0,
    "throughput" : 0.6561679790026247,
    "receivedKBytesPerSec" : 5.054159489829396,
    "sentKBytesPerSec" : 0.09675914534120734
  }
}